Revit 2024 API
Wire.InsertVertex Method
 Inserts a new vertex before the specified index.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void InsertVertex(
	int index,
	XYZ vertexPoint
)
Visual Basic
Public Sub InsertVertex ( _
	index As Integer, _
	vertexPoint As XYZ _
)
Visual C++
public:
void InsertVertex(
	int index,
	XYZ^ vertexPoint
)
Parameters
index
Type: System.Int32
 The index of the vertex to come after this new vertex. Should be between 0 and NumberOfVertices.
vertexPoint
Type: Autodesk.Revit.DB.XYZ
 The point of the new vertex.
Remarks
 To add a new vertex to the end of the wire, use AppendVertex(XYZ).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The index should be between 0 and the number of vertices of the wire. -or- The vertex point cannot be added to the wire because there is already a vertex at this position on the view plane (within tolerance).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  Can't insert the vertex before the start vertex if the start point connects to one element.
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace